#### Terraform Plan 📖
**Plan Exit Code:** `2` (No changes)

<details><summary>Show Plan</summary>

```hcl
module.eks_blueprints_addons.random_bytes.this: Refreshing state...
data.aws_availability_zones.azs: Reading...
module.eks.data.aws_partition.current[0]: Reading...
aws_iam_role.external-admin: Refreshing state... [id=external-admin]
module.eks.module.eks_managed_node_group["dev"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/fiifi-eks-cluster/cluster]
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Reading...
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_blueprints_addons.data.aws_region.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["dev"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks_blueprints_addons.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.eks_managed_node_group["dev"].data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0249f1bdd13b995a1]
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["dev"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["dev"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints_addons.data.aws_partition.current: Reading...
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_blueprints_addons.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.external-developer: Refreshing state... [id=external-developer]
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_blueprints_addons.data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=495599766789]
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=495599766789]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=fiifi-eks-cluster-cluster-20250626221220213100000004]
module.eks.module.eks_managed_node_group["dev"].data.aws_caller_identity.current: Read complete after 0s [id=495599766789]
module.eks.module.eks_managed_node_group["dev"].aws_iam_role.this[0]: Refreshing state... [id=dev-eks-node-group-20250626221220210800000001]
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Read complete after 0s [id=495599766789]
module.eks_blueprints_addons.data.aws_caller_identity.current: Read complete after 0s [id=495599766789]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Read complete after 0s [id=495599766789]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
data.aws_availability_zones.azs: Read complete after 0s [id=us-east-1]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::495599766789:policy/fiifi-eks-cluster-cluster-20250626221220211200000002]
module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Reading...
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::495599766789:assumed-role/my-github-actions-role/GitHubActions]
module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Read complete after 0s [id=481461162]
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Reading...
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=481461162]
module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_policy.this[0]: Refreshing state... [id=arn:aws:iam::495599766789:policy/alb-controller-20250626221220212900000003]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=fiifi-eks-cluster-cluster-20250626221220213100000004-20250626221220516300000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=fiifi-eks-cluster-cluster-20250626221220213100000004-20250626221220543100000009]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2686203170]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=4642e254-af2b-4192-8d87-efffb264608d]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=fiifi-eks-cluster-cluster-20250626221220213100000004-20250626221220497000000006]
module.eks.module.eks_managed_node_group["dev"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=dev-eks-node-group-20250626221220210800000001-20250626221220500500000007]
module.eks.module.eks_managed_node_group["dev"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=dev-eks-node-group-20250626221220210800000001-2025062622122058940000000a]
module.eks.module.eks_managed_node_group["dev"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=dev-eks-node-group-20250626221220210800000001-20250626221220484200000005]
aws_iam_role_policy.external-admin-eks-access: Refreshing state... [id=external-admin:eks-read-only-access]
aws_iam_role_policy.external-developer-eks-access: Refreshing state... [id=external-developer:eks-read-only-access]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/fiifi-eks-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::495599766789:policy/fiifi-eks-cluster-cluster-ClusterEncryption2025062622124167980000000e]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=fiifi-eks-cluster-cluster-20250626221220213100000004-2025062622124193820000000f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0f95fbd872ba34eb3]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e4a64b776f2ad73e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-047e3971ebc9521be]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05507637b239e96c2]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02f8599c03656dfe9]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-065dd128360087900]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-048146d8bc39e6023]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-00e40f7daaa2139f0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0eb7dfc2aacddbdcb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b758ebfbe6099b62]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0892df85d4a4fc1cb]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-02a86f6846cb1d709]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0534be3f5fbff1f6a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0eb7dfc2aacddbdcb1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d7bcce987e125f6c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0ef7ef0173c12384a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02054b434a75a8151]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d4aa912229fb0f1b]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0da05df483b50a6a5]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-021d65af3ab0b567d]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=fiifi-eks-cluster]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04d426e5e2422860d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-048146d8bc39e60231080289494]
module.eks.aws_eks_access_entry.this["admin"]: Refreshing state... [id=fiifi-eks-cluster:arn:aws:iam::495599766789:role/external-admin]
module.eks.aws_eks_access_entry.this["developer"]: Refreshing state... [id=fiifi-eks-cluster:arn:aws:iam::495599766789:role/external-developer]
module.eks.aws_ec2_tag.cluster_primary_security_group["application"]: Refreshing state... [id=sg-03afbd99fc49569b4,application]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=fiifi-eks-cluster:arn:aws:iam::495599766789:role/my-github-actions-role]
module.eks.aws_ec2_tag.cluster_primary_security_group["environment"]: Refreshing state... [id=sg-03afbd99fc49569b4,environment]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-06-26T22:23:05Z]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::495599766789:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8D194D70F5FC1A123530F7C64E156946]
module.eks.module.eks_managed_node_group["dev"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=3641234402614542772]
module.eks.module.eks_managed_node_group["dev"].aws_launch_template.this[0]: Refreshing state... [id=lt-0471ee121afa0663a]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks_managed_node_group["dev"].aws_eks_node_group.this[0]: Refreshing state... [id=fiifi-eks-cluster:dev-20250626222311479000000018]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=fiifi-eks-cluster#arn:aws:iam::495599766789:role/my-github-actions-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=fiifi-eks-cluster:coredns]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=fiifi-eks-cluster:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=fiifi-eks-cluster:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=fiifi-eks-cluster:vpc-cni]
module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.eks_blueprints_addons.time_sleep.this: Refreshing state... [id=2025-06-26T22:23:08Z]
module.eks_blueprints_addons.aws_cloudformation_stack.usage_telemetry[0]: Refreshing state... [id=arn:aws:cloudformation:us-east-1:495599766789:stack/fiifi-eks-cluster-cc4f/113fec10-52dc-11f0-9f2b-12ee5888ce31]
module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=3596436778]
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Reading...
kubernetes_cluster_role.cluster_viewer: Refreshing state... [id=cluster-viewer]
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3596436778]
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Reading...
module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=2232306881]
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Reading...
module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_policy.this[0]: Refreshing state... [id=arn:aws:iam::495599766789:policy/cluster-autoscaler-20250626222238307100000011]
module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=4264891297]
module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role.this[0]: Refreshing state... [id=alb-controller-20250626222308355800000015]
module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler-20250626222308349400000014]
module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=cluster-autoscaler-20250626222308349400000014-20250626222308571000000016]
module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=alb-controller-20250626222308355800000015-20250626222308636900000017]
kubernetes_cluster_role_binding.cluster_viewer: Refreshing state... [id=cluster-viewer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_namespace.online-boutique will be created
  + resource "kubernetes_namespace" "online-boutique" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_role.namespace-viewer will be created
  + resource "kubernetes_role" "namespace-viewer" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-viewer"
          + namespace        = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
              + "persistentvolumeclaims",
              + "pods",
              + "secrets",
              + "services",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "apps",
            ]
          + resources  = [
              + "daemonsets",
              + "deployments",
              + "statefulsets",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # kubernetes_role_binding.namespace-viewer will be created
  + resource "kubernetes_role_binding" "namespace-viewer" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-viewer"
          + namespace        = "online-boutique"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "namespace-viewer"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "developer"
          + namespace = "default"
        }
      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "User"
          + name      = "arn:aws:sts::495599766789:assumed-role/external-developer/K8SSession"
          + namespace = "default"
        }
    }

  # module.eks.module.eks_managed_node_group["dev"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "fiifi-eks-cluster:dev-20250626222311479000000018"
        tags                   = {
            "Name"        = "dev"
            "application" = "fiifi"
            "environment" = "development"
        }
        # (16 unchanged attributes hidden)

      ~ scaling_config {
          ~ max_size     = 4 -> 3
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.eks_blueprints_addons.module.aws_load_balancer_controller.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to deploy aws-load-balancer-controller for ingress resources"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "1.7.1"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "fiifi-eks-cluster"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = "arn:aws:iam::495599766789:role/alb-controller-20250626222308355800000015"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller-sa"
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks_blueprints_addons.module.cluster_autoscaler.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to deploy cluster-autoscaler"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "9.35.0"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "fiifi-eks-cluster"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "awsRegion"
          + value = "us-east-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-unneeded-time"
          + value = "2m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-local-storage"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-system-pods"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "image.tag"
          + value = "v1.32.0"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = "arn:aws:iam::495599766789:role/cluster-autoscaler-20250626222308349400000014"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler-sa"
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks_blueprints_addons.module.metrics_server.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to install the Metrics Server"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "3.12.0"
      + wait                       = false
      + wait_for_jobs              = false
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```

</details>